#include<stdio.h>

int test_function(int x)
{
    int y = x ; //একটি লোকাল ভেরিয়েবল y তৈরি হয় এবং এটির মান হয় x এর সমান। 
    x = 2*y; //এরপর x এর মান আপডেট হয় এমনভাবে যে, এটি হয় 2*y।
    return (x * y); //ফাংশনটি (x * y) এর গুণফল রিটার্ন করে।
}
int main() {
    int x = 10, y = 20, z = 5;
    z = test_function(x);//test_function কে x এর সাথে কল করা হয়।
    printf("%d %d %d \n", x, y, z);

    return 0;
}
// শুরুতে, x = 10, y = 20, এবং z = 5।
// test_function এর মধ্যে, y এর মান হয় x এর সমান, তাই y এর মান হয় 10।
// x এর মান হয় 2*y এর সমান, তাই x এর মান হয় 20।
// ফাংশনটি (x * y) এর যোগফল রিটার্ন করছে, তাই ফাংশনের মধ্যে থাকা মান হচ্ছে 20 * 10 = 200।
// এই মানটি z ভেরিয়েবলে সেট হয়ে যায়।